-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: localhost
-- Generation Time: Oct 13, 2025 at 10:05 AM
-- Server version: 10.4.28-MariaDB
-- PHP Version: 8.2.4

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `rokok_stock`
--

-- --------------------------------------------------------

--
-- Table structure for table `capital`
--

CREATE TABLE `capital` (
  `capital_id` int(11) NOT NULL,
  `capital_balance` decimal(10,2) NOT NULL,
  `count_capital` decimal(10,2) NOT NULL,
  `slip_capital` varchar(300) NOT NULL,
  `date_time_ad` datetime NOT NULL,
  `adder_id` int(11) NOT NULL,
  `create_at` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `capital`
--

INSERT INTO `capital` (`capital_id`, `capital_balance`, `count_capital`, `slip_capital`, `date_time_ad`, `adder_id`, `create_at`) VALUES
(24, 0.00, 2000000.00, 'img_68e3282e7ccfa.jpg', '2025-08-01 03:49:00', 1, '2025-10-01 03:49:30'),
(25, 1443035.01, 10000.00, '', '2025-10-08 20:52:00', 1, '2025-10-08 20:52:41');

-- --------------------------------------------------------

--
-- Table structure for table `custom_debtpaid`
--

CREATE TABLE `custom_debtpaid` (
  `id_debtpaid` int(11) NOT NULL,
  `serial_number` varchar(200) NOT NULL,
  `name_customer` varchar(200) NOT NULL,
  `count_debtpaid` decimal(10,2) NOT NULL,
  `debtpaid_balance` decimal(10,2) NOT NULL,
  `count_order_pay` int(11) NOT NULL,
  `datetime_pays` datetime NOT NULL,
  `text_reason` text NOT NULL,
  `img_debt` varchar(200) NOT NULL,
  `adder_id` int(11) NOT NULL,
  `create_at` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `custom_debtpaid`
--

INSERT INTO `custom_debtpaid` (`id_debtpaid`, `serial_number`, `name_customer`, `count_debtpaid`, `debtpaid_balance`, `count_order_pay`, `datetime_pays`, `text_reason`, `img_debt`, `adder_id`, `create_at`) VALUES
(11, '1JUYTUNRKO', 'เเบยา ทุ่งยางเเดง', 20000.00, 20530.00, 1, '2025-10-06 09:20:00', 'xxxx', '', 1, '2025-10-06 09:20:23'),
(12, 'U14KT28AU9', 'เเบยา ทุ่งยางเเดง', 10200.00, 10330.00, 1, '2025-10-07 15:49:00', 'test', '', 1, '2025-10-07 15:49:38'),
(13, '51FNOKYUN4', 'เเบยา ทุ่งยางเเดง', 10000.00, 330.00, 1, '2025-10-07 17:11:00', 'xxx test', '', 1, '2025-10-07 17:12:08'),
(14, 'AVJWVHB4LS', 'เเบยา ทุ่งยางเเดง', 330.00, 0.00, 1, '2025-10-07 17:12:00', 'test pay debt', 'img_68e4e7c71cc4b.jpg', 1, '2025-10-07 17:13:27'),
(15, 'S4RRYRK5MO', 'เเบลัน สายบุรี', 20000.00, 55050.00, 1, '2025-10-07 17:48:00', 'test', 'img_68e4f007f2952.webp', 1, '2025-10-07 17:48:39'),
(16, 'LNUYCB14A5', 'เเบลัน สายบุรี', 300.00, 54750.00, 1, '2025-10-08 14:12:00', '', '', 1, '2025-10-08 14:13:05'),
(17, 'XNOO0REFYC', 'เเบลัน สายบุรี', 40000.00, 14750.00, 3, '2025-10-08 14:40:00', 'xxxxx', '', 1, '2025-10-08 14:41:09');

-- --------------------------------------------------------

--
-- Table structure for table `list_productsell`
--

CREATE TABLE `list_productsell` (
  `list_sellid` int(11) NOT NULL,
  `ordersell_id` int(15) NOT NULL,
  `productname` varchar(250) NOT NULL,
  `rate_customertype` decimal(10,2) NOT NULL,
  `type_custom` varchar(100) NOT NULL,
  `tatol_product` int(11) NOT NULL,
  `price_to_pay` decimal(10,2) NOT NULL,
  `create_at` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `list_productsell`
--

INSERT INTO `list_productsell` (`list_sellid`, `ordersell_id`, `productname`, `rate_customertype`, `type_custom`, `tatol_product`, `price_to_pay`, `create_at`) VALUES
(419, 90, 'J2', 3.70, 'price_customer_dealer', 1000, 3700.00, '2025-09-27 06:44:18'),
(420, 90, 'J4', 4.00, 'price_customer_dealer', 760, 3040.00, '2025-09-27 06:44:18'),
(421, 90, 'J5', 6.00, 'price_customer_dealer', 800, 4800.00, '2025-09-27 06:44:18'),
(422, 90, 'J6', 6.50, 'price_customer_dealer', 800, 5200.00, '2025-09-27 06:44:18'),
(423, 90, 'J10', 7.50, 'price_customer_dealer', 580, 4350.00, '2025-09-27 06:44:18'),
(424, 90, '๋J12', 9.50, 'price_customer_dealer', 420, 3990.00, '2025-09-27 06:44:18'),
(425, 90, 'J15', 10.50, 'price_customer_dealer', 500, 5250.00, '2025-09-27 06:44:18'),
(434, 93, 'J1', 2.00, 'price_customer_dealer', 1500, 3000.00, '2025-09-27 06:54:15'),
(435, 93, 'J2', 3.70, 'price_customer_dealer', 500, 1850.00, '2025-09-27 06:54:15'),
(436, 93, 'J3', 3.80, 'price_customer_dealer', 1500, 5700.00, '2025-09-27 06:54:15'),
(437, 93, 'J4', 4.00, 'price_customer_dealer', 500, 2000.00, '2025-09-27 06:54:15'),
(438, 93, 'J5', 6.00, 'price_customer_dealer', 500, 3000.00, '2025-09-27 06:54:15'),
(439, 93, 'J6', 6.50, 'price_customer_dealer', 500, 3250.00, '2025-09-27 06:54:15'),
(440, 93, 'J8', 5.10, 'price_customer_dealer', 1500, 7650.00, '2025-09-27 06:54:15'),
(441, 93, 'J10', 7.50, 'price_customer_dealer', 500, 3750.00, '2025-09-27 06:54:15'),
(442, 94, 'J1', 2.30, 'price_custommer_vip', 500, 1150.00, '2025-09-27 07:00:37'),
(443, 94, 'J2', 4.00, 'price_custommer_vip', 500, 2000.00, '2025-09-27 07:00:37'),
(444, 94, 'J3', 4.20, 'price_custommer_vip', 300, 1260.00, '2025-09-27 07:00:37'),
(445, 94, 'J4', 4.30, 'price_custommer_vip', 200, 860.00, '2025-09-27 07:00:37'),
(446, 94, 'J5', 6.60, 'price_custommer_vip', 200, 1320.00, '2025-09-27 07:00:37'),
(447, 94, 'J6', 7.10, 'price_custommer_vip', 200, 1420.00, '2025-09-27 07:00:37'),
(448, 94, 'J8', 5.60, 'price_custommer_vip', 200, 1120.00, '2025-09-27 07:00:37'),
(449, 94, 'J10', 8.20, 'price_custommer_vip', 300, 2460.00, '2025-09-27 07:00:37'),
(450, 94, '๋J12', 10.10, 'price_custommer_vip', 100, 1010.00, '2025-09-27 07:00:37'),
(451, 94, 'J15', 11.10, 'price_custommer_vip', 200, 2220.00, '2025-09-27 07:00:37'),
(452, 94, 'G', 14.60, 'price_custommer_vip', 500, 7300.00, '2025-09-27 07:00:37'),
(453, 94, 'M', 17.80, 'price_custommer_vip', 500, 8900.00, '2025-09-27 07:00:37'),
(454, 94, 'เทปกาว', 1350.00, 'price_customer_deliver', 2, 2700.00, '2025-09-27 07:00:37'),
(455, 95, 'J1', 2.30, 'price_custommer_vip', 1000, 2300.00, '2025-09-27 07:03:37'),
(456, 95, 'J2', 4.00, 'price_custommer_vip', 1000, 4000.00, '2025-09-27 07:03:37'),
(457, 95, 'J3', 4.20, 'price_custommer_vip', 1000, 4200.00, '2025-09-27 07:03:37'),
(458, 95, 'J4', 4.30, 'price_custommer_vip', 1000, 4300.00, '2025-09-27 07:03:37'),
(459, 95, 'J5', 6.60, 'price_custommer_vip', 1000, 6600.00, '2025-09-27 07:03:37'),
(460, 95, 'J6', 7.10, 'price_custommer_vip', 1000, 7100.00, '2025-09-27 07:03:37'),
(461, 95, 'J8', 5.60, 'price_custommer_vip', 1000, 5600.00, '2025-09-27 07:03:37'),
(462, 95, 'J10', 8.20, 'price_custommer_vip', 1000, 8200.00, '2025-09-27 07:03:37'),
(463, 96, 'J1', 2.30, 'price_custommer_vip', 3000, 6900.00, '2025-09-27 07:05:35'),
(464, 96, 'J2', 4.00, 'price_custommer_vip', 2000, 8000.00, '2025-09-27 07:05:35'),
(465, 96, 'J3', 4.20, 'price_custommer_vip', 3000, 12600.00, '2025-09-27 07:05:35'),
(466, 96, 'J4', 4.30, 'price_custommer_vip', 2800, 12040.00, '2025-09-27 07:05:35'),
(467, 96, 'J5', 6.60, 'price_custommer_vip', 3000, 19800.00, '2025-09-27 07:05:35'),
(468, 97, 'J1', 2.20, 'price_customer_frontstore', 60, 132.00, '2025-09-27 07:08:51'),
(469, 97, 'J2', 3.90, 'price_customer_frontstore', 80, 312.00, '2025-09-27 07:08:51'),
(470, 97, 'J3', 4.10, 'price_customer_frontstore', 20, 82.00, '2025-09-27 07:08:51'),
(471, 97, 'J5', 6.50, 'price_customer_frontstore', 60, 390.00, '2025-09-27 07:08:51'),
(472, 97, 'J6', 7.00, 'price_customer_frontstore', 40, 280.00, '2025-09-27 07:08:51'),
(473, 97, 'M', 17.70, 'price_customer_frontstore', 10, 177.00, '2025-09-27 07:08:51'),
(474, 98, 'J1', 2.20, 'price_customer_frontstore', 200, 440.00, '2025-09-27 07:13:35'),
(475, 98, 'J2', 3.90, 'price_customer_frontstore', 200, 780.00, '2025-09-27 07:13:35'),
(476, 98, 'J3', 4.10, 'price_customer_frontstore', 200, 820.00, '2025-09-27 07:13:35'),
(477, 98, 'J4', 4.20, 'price_customer_frontstore', 200, 840.00, '2025-09-27 07:13:35'),
(478, 98, 'J5', 6.50, 'price_customer_frontstore', 200, 1300.00, '2025-09-27 07:13:35'),
(479, 98, 'J6', 7.00, 'price_customer_frontstore', 200, 1400.00, '2025-09-27 07:13:35'),
(480, 98, 'J8', 5.50, 'price_customer_frontstore', 100, 550.00, '2025-09-27 07:13:35'),
(481, 98, 'J10', 8.00, 'price_customer_frontstore', 200, 1600.00, '2025-09-27 07:13:35'),
(482, 98, 'J15', 11.00, 'price_customer_frontstore', 100, 1100.00, '2025-09-27 07:13:35'),
(483, 98, 'G', 14.50, 'price_customer_frontstore', 40, 580.00, '2025-09-27 07:13:35'),
(484, 98, 'M', 17.70, 'price_customer_frontstore', 50, 885.00, '2025-09-27 07:13:35'),
(485, 99, 'G', 14.50, 'price_customer_frontstore', 10, 145.00, '2025-09-27 07:14:44'),
(486, 99, 'M', 17.70, 'price_customer_frontstore', 10, 177.00, '2025-09-27 07:14:44'),
(487, 100, 'J1', 2.20, 'price_customer_frontstore', 20, 44.00, '2025-09-27 07:17:17'),
(488, 100, 'J2', 3.90, 'price_customer_frontstore', 20, 78.00, '2025-09-27 07:17:17'),
(489, 100, 'J3', 4.10, 'price_customer_frontstore', 20, 82.00, '2025-09-27 07:17:17'),
(490, 100, 'J5', 6.50, 'price_customer_frontstore', 20, 130.00, '2025-09-27 07:17:17'),
(491, 101, 'J2', 3.90, 'price_customer_frontstore', 200, 780.00, '2025-09-27 07:19:11'),
(492, 101, 'J3', 4.10, 'price_customer_frontstore', 120, 492.00, '2025-09-27 07:19:11'),
(493, 101, 'J5', 6.50, 'price_customer_frontstore', 200, 1300.00, '2025-09-27 07:19:11'),
(494, 101, 'J6', 7.00, 'price_customer_frontstore', 200, 1400.00, '2025-09-27 07:19:11'),
(495, 101, '๋J12', 10.00, 'price_customer_frontstore', 20, 200.00, '2025-09-27 07:19:11'),
(496, 101, 'J15', 11.00, 'price_customer_frontstore', 20, 220.00, '2025-09-27 07:19:11'),
(497, 102, 'J1', 2.20, 'price_customer_frontstore', 500, 1100.00, '2025-09-27 07:22:15'),
(498, 102, 'J2', 3.90, 'price_customer_frontstore', 20, 78.00, '2025-09-27 07:22:15'),
(499, 102, 'J3', 4.10, 'price_customer_frontstore', 500, 2050.00, '2025-09-27 07:22:15'),
(500, 102, 'J4', 4.20, 'price_customer_frontstore', 500, 2100.00, '2025-09-27 07:22:15'),
(501, 102, 'J5', 6.50, 'price_customer_frontstore', 20, 130.00, '2025-09-27 07:22:15'),
(502, 102, 'J6', 7.00, 'price_customer_frontstore', 20, 140.00, '2025-09-27 07:22:15'),
(503, 102, 'J8', 5.50, 'price_customer_frontstore', 20, 110.00, '2025-09-27 07:22:15'),
(504, 102, 'J10', 8.00, 'price_customer_frontstore', 20, 160.00, '2025-09-27 07:22:15'),
(505, 102, '๋J12', 10.00, 'price_customer_frontstore', 500, 5000.00, '2025-09-27 07:22:15'),
(506, 102, 'J15', 11.00, 'price_customer_frontstore', 500, 5500.00, '2025-09-27 07:22:15'),
(507, 102, 'G', 14.50, 'price_customer_frontstore', 500, 7250.00, '2025-09-27 07:22:15'),
(508, 102, 'M', 17.70, 'price_customer_frontstore', 500, 8850.00, '2025-09-27 07:22:15'),
(509, 103, 'J2', 3.90, 'price_customer_frontstore', 20, 78.00, '2025-09-27 08:02:00'),
(510, 103, 'J10', 8.00, 'price_customer_frontstore', 120, 960.00, '2025-09-27 08:02:00'),
(511, 103, '๋J12', 10.00, 'price_customer_frontstore', 20, 200.00, '2025-09-27 08:02:00'),
(512, 103, 'J15', 11.00, 'price_customer_frontstore', 20, 220.00, '2025-09-27 08:02:00'),
(513, 104, 'J1', 2.20, 'price_customer_frontstore', 300, 660.00, '2025-09-27 08:07:05'),
(514, 104, 'J2', 3.90, 'price_customer_frontstore', 260, 1014.00, '2025-09-27 08:07:05'),
(515, 104, 'J3', 4.10, 'price_customer_frontstore', 300, 1230.00, '2025-09-27 08:07:05'),
(516, 104, 'J4', 4.20, 'price_customer_frontstore', 400, 1680.00, '2025-09-27 08:07:05'),
(517, 104, 'J5', 6.50, 'price_customer_frontstore', 400, 2600.00, '2025-09-27 08:07:05'),
(518, 104, 'J6', 7.00, 'price_customer_frontstore', 400, 2800.00, '2025-09-27 08:07:05'),
(519, 104, 'J8', 5.50, 'price_customer_frontstore', 400, 2200.00, '2025-09-27 08:07:05'),
(520, 104, 'J10', 8.00, 'price_customer_frontstore', 300, 2400.00, '2025-09-27 08:07:05'),
(521, 104, '๋J12', 10.00, 'price_customer_frontstore', 300, 3000.00, '2025-09-27 08:07:05'),
(522, 104, 'J15', 11.00, 'price_customer_frontstore', 400, 4400.00, '2025-09-27 08:07:05'),
(523, 104, 'G', 2.20, 'price_customer_frontstore', 400, 5800.00, '2025-09-27 08:07:05'),
(524, 104, 'M', 17.70, 'price_customer_frontstore', 200, 3540.00, '2025-09-27 08:07:05'),
(525, 105, 'J3', 4.10, 'price_customer_frontstore', 20, 82.00, '2025-09-27 08:09:23'),
(526, 105, 'J4', 4.20, 'price_customer_frontstore', 20, 84.00, '2025-09-27 08:09:23'),
(527, 105, 'J5', 6.50, 'price_customer_frontstore', 20, 130.00, '2025-09-27 08:09:23'),
(528, 105, 'J6', 7.00, 'price_customer_frontstore', 20, 140.00, '2025-09-27 08:09:23'),
(529, 105, 'J8', 5.50, 'price_customer_frontstore', 20, 110.00, '2025-09-27 08:09:23'),
(530, 105, 'M', 17.70, 'price_customer_frontstore', 10, 177.00, '2025-09-27 08:09:23'),
(531, 106, 'J10', 8.00, 'price_customer_frontstore', 200, 1600.00, '2025-09-27 08:10:30'),
(532, 106, '๋J12', 10.00, 'price_customer_frontstore', 20, 200.00, '2025-09-27 08:10:30'),
(533, 106, 'J15', 11.00, 'price_customer_frontstore', 40, 440.00, '2025-09-27 08:10:30'),
(534, 107, 'J1', 2.20, 'price_customer_frontstore', 300, 660.00, '2025-09-27 08:13:29'),
(535, 107, 'J2', 3.90, 'price_customer_frontstore', 200, 780.00, '2025-09-27 08:13:29'),
(536, 107, 'J3', 4.10, 'price_customer_frontstore', 400, 1640.00, '2025-09-27 08:13:29'),
(537, 107, 'J4', 4.20, 'price_customer_frontstore', 200, 840.00, '2025-09-27 08:13:29'),
(538, 107, 'J5', 6.50, 'price_customer_frontstore', 200, 1300.00, '2025-09-27 08:13:29'),
(539, 107, 'J6', 7.00, 'price_customer_frontstore', 200, 1400.00, '2025-09-27 08:13:29'),
(540, 107, 'J8', 5.50, 'price_customer_frontstore', 200, 1100.00, '2025-09-27 08:13:29'),
(541, 107, 'J10', 8.00, 'price_customer_frontstore', 300, 2400.00, '2025-09-27 08:13:29'),
(542, 107, '๋J12', 10.00, 'price_customer_frontstore', 200, 2000.00, '2025-09-27 08:13:29'),
(543, 107, 'J15', 11.00, 'price_customer_frontstore', 400, 4400.00, '2025-09-27 08:13:29'),
(544, 107, 'G', 14.50, 'price_customer_frontstore', 400, 5800.00, '2025-09-27 08:13:29'),
(545, 107, 'F', 14.00, 'price_customer_frontstore', 300, 4200.00, '2025-09-27 08:13:29'),
(546, 108, 'J2', 3.70, 'price_customer_dealer', 1500, 5550.00, '2025-09-27 08:18:10'),
(547, 108, 'J4', 4.00, 'price_customer_dealer', 500, 2000.00, '2025-09-27 08:18:10'),
(548, 108, 'J5', 6.00, 'price_customer_dealer', 1500, 9000.00, '2025-09-27 08:18:10'),
(549, 108, '๋J12', 9.50, 'price_customer_dealer', 500, 4750.00, '2025-09-27 08:18:10'),
(550, 109, 'J6', 6.50, 'price_customer_dealer', 1400, 9100.00, '2025-09-27 08:20:11'),
(551, 109, 'J10', 7.50, 'price_customer_dealer', 1000, 7500.00, '2025-09-27 08:20:11'),
(552, 109, 'J15', 10.50, 'price_customer_dealer', 1000, 10500.00, '2025-09-27 08:20:11'),
(553, 110, 'J1', 2.00, 'price_customer_dealer', 1000, 2000.00, '2025-09-27 08:22:37'),
(554, 110, 'J3', 3.80, 'price_customer_dealer', 1000, 3800.00, '2025-09-27 08:22:37'),
(555, 110, 'J8', 5.10, 'price_customer_dealer', 1000, 5100.00, '2025-09-27 08:22:37'),
(556, 110, 'G', 14.00, 'price_customer_dealer', 500, 7000.00, '2025-09-27 08:22:37'),
(557, 110, 'M', 17.50, 'price_customer_dealer', 500, 8750.00, '2025-09-27 08:22:37'),
(558, 111, 'J1', 2.30, 'price_custommer_vip', 1500, 3450.00, '2025-09-27 15:24:02'),
(559, 111, 'J2', 4.00, 'price_custommer_vip', 2000, 8000.00, '2025-09-27 15:24:02'),
(560, 111, 'J3', 4.20, 'price_custommer_vip', 1500, 6300.00, '2025-09-27 15:24:02'),
(561, 111, 'J4', 4.30, 'price_custommer_vip', 1000, 4300.00, '2025-09-27 15:24:02'),
(562, 111, '๋J12', 10.10, 'price_custommer_vip', 600, 6060.00, '2025-09-27 15:24:02'),
(563, 111, 'J15', 11.10, 'price_custommer_vip', 600, 6660.00, '2025-09-27 15:24:02'),
(564, 111, 'G', 14.60, 'price_custommer_vip', 800, 11680.00, '2025-09-27 15:24:02'),
(565, 112, 'J2', 4.20, 'price_customer_deliver', 100, 420.00, '2025-09-27 15:33:15'),
(566, 112, 'J4', 4.70, 'price_customer_deliver', 100, 470.00, '2025-09-27 15:33:15'),
(567, 112, 'J5', 7.00, 'price_customer_deliver', 100, 700.00, '2025-09-27 15:33:15'),
(568, 112, 'J6', 9.50, 'price_customer_deliver', 100, 950.00, '2025-09-27 15:33:15'),
(569, 112, 'J10', 9.75, 'price_customer_deliver', 100, 975.00, '2025-09-27 15:33:15'),
(570, 112, '๋J12', 10.20, 'price_customer_deliver', 100, 1020.00, '2025-09-27 15:33:15'),
(571, 112, 'J15', 11.20, 'price_customer_deliver', 100, 1120.00, '2025-09-27 15:33:15'),
(572, 112, 'เทปกาว', 1350.00, 'price_customer_deliver', 2, 2700.00, '2025-09-27 15:33:15'),
(573, 113, 'J2', 4.20, 'price_customer_deliver', 100, 420.00, '2025-09-27 15:35:20'),
(574, 113, 'J4', 4.70, 'price_customer_deliver', 100, 470.00, '2025-09-27 15:35:20'),
(575, 113, 'J5', 7.00, 'price_customer_deliver', 100, 700.00, '2025-09-27 15:35:20'),
(576, 113, 'J6', 9.50, 'price_customer_deliver', 100, 950.00, '2025-09-27 15:35:20'),
(577, 113, 'J10', 9.75, 'price_customer_deliver', 100, 975.00, '2025-09-27 15:35:20'),
(578, 113, '๋J12', 10.20, 'price_customer_deliver', 100, 1020.00, '2025-09-27 15:35:20'),
(579, 113, 'J15', 11.20, 'price_customer_deliver', 100, 1120.00, '2025-09-27 15:35:20'),
(580, 114, 'J2', 4.20, 'price_customer_deliver', 500, 2100.00, '2025-09-27 15:36:59'),
(581, 114, 'J4', 4.70, 'price_customer_deliver', 500, 2350.00, '2025-09-27 15:36:59'),
(582, 114, 'J5', 7.00, 'price_customer_deliver', 500, 3500.00, '2025-09-27 15:36:59'),
(583, 115, 'J1', 2.50, 'price_customer_deliver', 100, 250.00, '2025-09-27 15:39:03'),
(584, 115, 'J2', 4.20, 'price_customer_deliver', 100, 420.00, '2025-09-27 15:39:03'),
(585, 115, 'J3', 4.60, 'price_customer_deliver', 200, 920.00, '2025-09-27 15:39:03'),
(586, 115, 'J4', 4.70, 'price_customer_deliver', 100, 470.00, '2025-09-27 15:39:03'),
(587, 115, 'G', 14.90, 'price_customer_deliver', 50, 745.00, '2025-09-27 15:39:03'),
(588, 115, 'M', 17.90, 'price_customer_deliver', 230, 4117.00, '2025-09-27 15:39:03'),
(589, 116, 'J1', 2.50, 'price_customer_deliver', 300, 750.00, '2025-09-27 15:43:10'),
(590, 116, 'J2', 4.20, 'price_customer_deliver', 300, 1260.00, '2025-09-27 15:43:10'),
(591, 116, 'J3', 4.60, 'price_customer_deliver', 300, 1380.00, '2025-09-27 15:43:10'),
(592, 116, 'J4', 4.70, 'price_customer_deliver', 300, 1410.00, '2025-09-27 15:43:10'),
(593, 116, 'J5', 7.00, 'price_customer_deliver', 100, 700.00, '2025-09-27 15:43:10'),
(594, 116, 'J10', 9.75, 'price_customer_deliver', 100, 975.00, '2025-09-27 15:43:10'),
(595, 116, 'G', 14.90, 'price_customer_deliver', 150, 2235.00, '2025-09-27 15:43:10'),
(596, 116, 'M', 17.90, 'price_customer_deliver', 150, 2685.00, '2025-09-27 15:43:10'),
(597, 116, 'เทปกาว', 10.20, 'price_customer_deliver', 2, 2700.00, '2025-09-27 15:43:10'),
(598, 117, 'J1', 2.50, 'price_customer_deliver', 400, 1000.00, '2025-09-27 15:45:55'),
(599, 117, 'J2', 4.20, 'price_customer_deliver', 400, 1680.00, '2025-09-27 15:45:55'),
(600, 117, 'J3', 4.60, 'price_customer_deliver', 400, 1840.00, '2025-09-27 15:45:55'),
(601, 117, 'J4', 4.70, 'price_customer_deliver', 400, 1880.00, '2025-09-27 15:45:55'),
(602, 117, 'J5', 7.00, 'price_customer_deliver', 400, 2800.00, '2025-09-27 15:45:55'),
(603, 117, 'J8', 5.90, 'price_customer_deliver', 200, 1180.00, '2025-09-27 15:45:55'),
(604, 117, 'G', 14.90, 'price_customer_deliver', 200, 2980.00, '2025-09-27 15:45:55'),
(605, 117, 'M', 17.90, 'price_customer_deliver', 900, 16110.00, '2025-09-27 15:45:55'),
(606, 117, 'เทปกาว', 1350.00, 'price_customer_deliver', 3, 4050.00, '2025-09-27 15:45:55'),
(607, 117, 'บับเบิ้ล', 105.00, 'price_customer_deliver', 2, 210.00, '2025-09-27 15:45:55'),
(608, 118, 'J3', 4.60, 'price_customer_deliver', 200, 920.00, '2025-09-27 15:48:38'),
(609, 118, 'J4', 4.70, 'price_customer_deliver', 100, 470.00, '2025-09-27 15:48:38'),
(610, 118, 'J5', 7.00, 'price_customer_deliver', 100, 700.00, '2025-09-27 15:48:38'),
(611, 118, 'J15', 11.20, 'price_customer_deliver', 200, 2240.00, '2025-09-27 15:48:38'),
(612, 118, 'บับเบิ้ล', 105.00, 'price_customer_deliver', 4, 420.00, '2025-09-27 15:48:38'),
(613, 119, 'J1', 2.50, 'price_customer_deliver', 400, 1000.00, '2025-09-27 15:52:17'),
(614, 119, 'J2', 4.20, 'price_customer_deliver', 400, 1680.00, '2025-09-27 15:52:17'),
(615, 119, 'J3', 4.60, 'price_customer_deliver', 200, 920.00, '2025-09-27 15:52:17'),
(616, 119, 'J4', 4.70, 'price_customer_deliver', 200, 940.00, '2025-09-27 15:52:17'),
(617, 119, 'J5', 7.00, 'price_customer_deliver', 200, 1400.00, '2025-09-27 15:52:17'),
(618, 119, 'J6', 9.50, 'price_customer_deliver', 200, 1900.00, '2025-09-27 15:52:17'),
(619, 119, '๋J12', 10.20, 'price_customer_deliver', 200, 2040.00, '2025-09-27 15:52:17'),
(620, 119, 'M', 17.90, 'price_customer_deliver', 150, 2685.00, '2025-09-27 15:52:17'),
(621, 119, 'บับเบิ้ล', 105.00, 'price_customer_deliver', 5, 525.00, '2025-09-27 15:52:17'),
(622, 120, 'J8', 5.90, 'price_customer_deliver', 200, 1180.00, '2025-09-27 15:54:08'),
(623, 120, 'J10', 9.75, 'price_customer_deliver', 400, 3900.00, '2025-09-27 15:54:08'),
(624, 121, 'J1', 2.50, 'price_customer_deliver', 800, 2000.00, '2025-09-27 15:58:05'),
(625, 121, 'J2', 4.20, 'price_customer_deliver', 600, 2520.00, '2025-09-27 15:58:05'),
(626, 121, 'J10', 9.75, 'price_customer_deliver', 600, 5850.00, '2025-09-27 15:58:05'),
(627, 121, '๋J12', 10.20, 'price_customer_deliver', 400, 4080.00, '2025-09-27 15:58:05'),
(628, 121, 'J15', 11.20, 'price_customer_deliver', 600, 6720.00, '2025-09-27 15:58:05'),
(629, 121, 'เทปกาว', 1350.00, 'price_customer_deliver', 3, 4050.00, '2025-09-27 15:58:05'),
(630, 121, 'M', 17.90, 'price_customer_deliver', 300, 5370.00, '2025-09-27 15:58:05'),
(631, 122, 'J1', 2.50, 'price_customer_deliver', 500, 1250.00, '2025-09-28 03:57:11'),
(632, 122, 'J2', 4.20, 'price_customer_deliver', 500, 2100.00, '2025-09-28 03:57:11'),
(633, 122, 'J3', 4.60, 'price_customer_deliver', 400, 1840.00, '2025-09-28 03:57:11'),
(634, 122, 'J4', 4.70, 'price_customer_deliver', 300, 1410.00, '2025-09-28 03:57:11'),
(635, 122, 'J5', 7.00, 'price_customer_deliver', 300, 2100.00, '2025-09-28 03:57:11'),
(636, 122, 'J8', 5.90, 'price_customer_deliver', 300, 1770.00, '2025-09-28 03:57:11'),
(637, 122, 'J10', 9.75, 'price_customer_deliver', 300, 2925.00, '2025-09-28 03:57:11'),
(638, 122, '๋J12', 10.20, 'price_customer_deliver', 100, 1020.00, '2025-09-28 03:57:11'),
(639, 122, 'J15', 11.20, 'price_customer_deliver', 300, 3360.00, '2025-09-28 03:57:11'),
(640, 122, 'G', 14.90, 'price_customer_deliver', 150, 2235.00, '2025-09-28 03:57:11'),
(641, 122, 'M', 17.90, 'price_customer_deliver', 150, 2685.00, '2025-09-28 03:57:11'),
(642, 122, 'เทปกาว', 1350.00, 'price_customer_deliver', 3, 4050.00, '2025-09-28 03:57:11'),
(643, 123, 'J15', 11.20, 'price_customer_deliver', 400, 4480.00, '2025-09-28 03:58:42'),
(644, 123, 'G', 14.90, 'price_customer_deliver', 600, 8940.00, '2025-09-28 03:58:42'),
(645, 124, 'J1', 2.50, 'price_customer_deliver', 200, 500.00, '2025-09-28 04:01:22'),
(646, 124, 'J2', 4.20, 'price_customer_deliver', 200, 840.00, '2025-09-28 04:01:22'),
(647, 124, 'J3', 4.60, 'price_customer_deliver', 200, 920.00, '2025-09-28 04:01:22'),
(648, 124, 'J4', 4.70, 'price_customer_deliver', 100, 470.00, '2025-09-28 04:01:22'),
(649, 124, 'J5', 7.00, 'price_customer_deliver', 200, 1400.00, '2025-09-28 04:01:22'),
(650, 124, 'J6', 9.50, 'price_customer_deliver', 100, 950.00, '2025-09-28 04:01:22'),
(651, 124, 'M', 17.90, 'price_customer_deliver', 300, 5370.00, '2025-09-28 04:01:22'),
(652, 124, 'F', 14.80, 'price_customer_deliver', 10, 148.00, '2025-09-28 04:01:22'),
(653, 124, 'เทปกาว', 1350.00, 'price_customer_deliver', 3, 4050.00, '2025-09-28 04:01:22'),
(654, 125, 'J1', 2.50, 'price_customer_deliver', 600, 1500.00, '2025-09-28 04:04:38'),
(655, 125, 'J2', 4.20, 'price_customer_deliver', 600, 2520.00, '2025-09-28 04:04:38'),
(656, 125, 'J3', 4.60, 'price_customer_deliver', 400, 1840.00, '2025-09-28 04:04:38'),
(657, 125, 'J4', 4.70, 'price_customer_deliver', 400, 1880.00, '2025-09-28 04:04:38'),
(658, 125, 'J5', 7.00, 'price_customer_deliver', 400, 2800.00, '2025-09-28 04:04:38'),
(659, 125, 'J6', 9.50, 'price_customer_deliver', 100, 950.00, '2025-09-28 04:04:38'),
(660, 125, 'J8', 5.90, 'price_customer_deliver', 100, 590.00, '2025-09-28 04:04:38'),
(661, 125, 'J10', 9.75, 'price_customer_deliver', 100, 975.00, '2025-09-28 04:04:38'),
(662, 125, 'M', 17.90, 'price_customer_deliver', 100, 1790.00, '2025-09-28 04:04:38'),
(663, 125, 'F', 14.80, 'price_customer_deliver', 10, 148.00, '2025-09-28 04:04:38'),
(664, 125, 'เทปกาว', 1350.00, 'price_customer_deliver', 1, 1350.00, '2025-09-28 04:04:38');

-- --------------------------------------------------------

--
-- Table structure for table `orders_sell`
--

CREATE TABLE `orders_sell` (
  `id_ordersell` int(11) NOT NULL,
  `ordersell_name` varchar(200) NOT NULL,
  `is_totalprice` decimal(10,2) NOT NULL,
  `custome_name` varchar(250) NOT NULL,
  `tell_custome` varchar(30) NOT NULL,
  `date_time_sell` datetime NOT NULL,
  `shipping_note` text NOT NULL,
  `sender` varchar(200) NOT NULL,
  `tell_sender` varchar(15) NOT NULL,
  `location_send` text NOT NULL,
  `wages` decimal(10,2) NOT NULL,
  `reason` text NOT NULL,
  `slip_ordersell` varchar(200) NOT NULL,
  `count_totalpays` decimal(10,2) NOT NULL,
  `count_stuck` decimal(10,2) NOT NULL,
  `adder_id` int(11) NOT NULL,
  `create_at` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `orders_sell`
--

INSERT INTO `orders_sell` (`id_ordersell`, `ordersell_name`, `is_totalprice`, `custome_name`, `tell_custome`, `date_time_sell`, `shipping_note`, `sender`, `tell_sender`, `location_send`, `wages`, `reason`, `slip_ordersell`, `count_totalpays`, `count_stuck`, `adder_id`, `create_at`) VALUES
(90, 'SPEACQ6NK8', 30330.00, 'เเบยา ทุ่งยางเเดง', '0000000000', '2025-08-10 06:43:00', '', '-', '0000000000', 'ทุ่งยางเเดง', 0.00, '', '', 20000.00, 10330.00, 1, '2025-09-27 06:44:18'),
(93, 'N6PUZ771W4', 30200.00, 'เเบยา ทุ่งยางเเดง', '0000000000', '2025-09-18 06:52:00', '', '-', '0000000000', 'ทุ่งยางแดง', 0.00, '', '', 0.00, 30200.00, 1, '2025-09-27 06:54:15'),
(94, 'L74K205363', 33720.00, 'เจะฆูซัน กรงปีนัง', '0000000000', '2025-09-14 07:00:00', '', 'บอสจู', '0000000000', 'กรงปีนัง', 0.00, '', 'img_68d7292507c49.jpg', 33720.00, 0.00, 1, '2025-09-27 07:00:37'),
(95, 'UG2WGE0JXI', 42300.00, 'โตะชุด', '0000000000', '2025-08-25 07:02:00', '', 'บอสจู', '0000000000', 'โตะชุ', 0.00, '', 'img_68d729d9afc3a.jpg', 42300.00, 0.00, 1, '2025-09-27 07:03:37'),
(96, 'R7D6GVNR28', 59340.00, 'โตะชุด', '0000000000', '2025-09-04 07:05:00', '', 'มะยา', '0000000000', 'โตะชุ', 0.00, '', 'img_68d72a4fea6f5.jpg', 59340.00, 0.00, 1, '2025-09-27 07:05:35'),
(97, 'DDSVFAGWCY', 1373.00, 'อาเเบ', '0000000000', '2025-08-11 07:08:00', '', '-', '0000000000', '-', 0.00, '', 'img_68d72b13f002d.jpg', 1373.00, 0.00, 1, '2025-09-27 07:08:51'),
(98, 'NTN1G45HTF', 10295.00, 'มะโตะพง', '0000000000', '2025-09-14 07:09:00', '', '-', '0000000000', '-', 0.00, '', 'img_68d72c2f12644.jpg', 10295.00, 0.00, 1, '2025-09-27 07:13:35'),
(99, 'BP2PGG9ZI9', 322.00, 'วัง', '0000000000', '2025-08-18 07:14:00', '', '-', '0000000000', '-', 0.00, '', 'img_68d72c74a2782.jpg', 322.00, 0.00, 1, '2025-09-27 07:14:44'),
(100, 'WAWRQPLKFF', 334.00, 'A', '0000000000', '2025-08-20 07:16:00', '', '-', '0000000000', '-', 0.00, '', 'img_68d72d0d4c554.jpg', 334.00, 0.00, 1, '2025-09-27 07:17:17'),
(101, 'G12QM89JIX', 4392.00, 'A', '0000000000', '2025-08-25 07:18:00', '', '-', '-', '-', 0.00, '', 'img_68d72d7f87845.jpg', 4392.00, 0.00, 1, '2025-09-27 07:19:11'),
(102, 'PUW2WIBYW7', 32468.00, 'พิเทน', '0000000000', '2025-09-08 07:21:00', '', '-', '0000000000', '-', 0.00, '', 'img_68d72e37adf78.jpg', 32468.00, 0.00, 1, '2025-09-27 07:22:15'),
(103, 'MBLM48KLXZ', 1458.00, 'A', '0000000000', '2025-09-10 08:01:00', '', '-', '0000000000', '-', 0.00, '', 'img_68d7378867c8a.jpg', 1458.00, 0.00, 1, '2025-09-27 08:02:00'),
(104, 'EMSW7ICLY7', 31324.00, 'พิเทน', '0000000000', '2025-09-16 08:05:00', '', '-', '0000000000', '', 0.00, '', '', 31324.00, 0.00, 1, '2025-09-27 08:07:05'),
(105, '82M5Z46LXV', 723.00, 'วัง', '0000000000', '2025-09-19 08:08:00', '', '-', '0000000000', '-', 0.00, '', 'img_68d739437eb6a.jpg', 723.00, 0.00, 1, '2025-09-27 08:09:23'),
(106, 'CH24FIHAOQ', 2240.00, 'เจะฆู คางา', '0000000000', '2025-09-23 08:10:00', '', '-', '0000000000', '-', 0.00, '', 'img_68d739865fcc1.jpg', 2240.00, 0.00, 1, '2025-09-27 08:10:30'),
(107, 'YADSRJGD3S', 26520.00, 'พิเทน', '0000000000', '2025-09-24 08:13:00', '', '-', '0000000000', '-', 0.00, '', 'img_68d73a391b2ed.jpg', 26520.00, 0.00, 1, '2025-09-27 08:13:29'),
(108, '2B7OK2GUOL', 21300.00, 'เเบลัน สายบุรี', '0000000000', '2025-08-09 08:17:00', '', 'บอสจู', '0000000000', 'สายบุรี', 0.00, '', '', 0.00, 21300.00, 1, '2025-09-27 08:18:10'),
(109, '8MN7CJC8OE', 27100.00, 'เเบลัน สายบุรี', '0000000000', '2025-08-10 08:19:00', '', '', '0000000000', 'สายบุรี', 0.00, '', '', 0.00, 27100.00, 1, '2025-09-27 08:20:24'),
(110, '6NJTUXMZ3I', 26650.00, 'เเบลัน สายบุรี', '0000000000', '2025-08-15 08:22:00', '', '-', '0000000000', 'สายบุรี', 0.00, '', '', 0.00, 26650.00, 1, '2025-09-27 08:22:37'),
(111, 'X5UM6GMSJA', 46450.00, 'พี่กุ้ง', '0897370160', '2025-09-27 15:23:00', '', 'ฟีฟี', '0000000000', 'ยะลา', 0.00, 'ส่งสอง 2 รอบ', 'img_68d79f2244ad4.jpg', 46450.00, 0.00, 1, '2025-09-27 15:24:02'),
(112, 'SXEKVGTTME', 8355.00, 'บอสยัง', '0000000000', '2025-08-11 15:32:00', '', '-', '0000000000', 'ปูยุด', 0.00, '', 'img_68d7a14b86e0f.jpg', 8355.00, 0.00, 1, '2025-09-27 15:33:15'),
(113, '6TOFYPICP8', 5655.00, 'บอสจู', '0000000000', '2025-08-11 15:35:00', '', '-', '0000000000', 'ปูยุด', 0.00, '', 'img_68d7a1c8b6f21.jpg', 5655.00, 0.00, 1, '2025-09-27 15:35:20'),
(114, 'QFG5VWLFSN', 7950.00, 'โตะชุด', '0000000000', '2025-08-11 15:36:00', '', '-', '0000000000', 'โตะชุ', 0.00, '', 'img_68d7a22b78a88.jpg', 7950.00, 0.00, 1, '2025-09-27 15:36:59'),
(115, 'CHLI8BOADX', 6922.00, 'บอสยัง', '0000000000', '2025-08-15 15:38:00', '', '-', '0000000000', 'ปูยุด', 0.00, '', 'img_68d7a2a793c7e.jpg', 6922.00, 0.00, 1, '2025-09-27 15:39:03'),
(116, 'XES37O8NY7', 14095.00, 'บอสจู', '0000000000', '2025-08-19 15:39:00', '', '-', '0000000000', 'ปูยุด', 0.00, '', 'img_68d7a39e8904f.jpg', 14095.00, 0.00, 1, '2025-09-27 15:43:10'),
(117, '8D68RQBZ7Y', 33730.00, 'บอสยัง', '0000000000', '2025-08-21 15:45:00', '', '-', '0000000000', 'ปูยุด', 0.00, '', 'img_68d7a44399dca.jpg', 33730.00, 0.00, 1, '2025-09-27 15:45:55'),
(118, 'EFVQWWBT0P', 4750.00, 'A', '0000000000', '2025-08-24 15:48:00', '', '-', '0000000000', '-', 0.00, '', 'img_68d7a4e62db50.jpg', 4750.00, 0.00, 1, '2025-09-27 15:48:38'),
(119, 'KPTAXO15CT', 13090.00, 'บอสจู', '0000000000', '2025-08-28 15:52:00', '', '-', '0000000000', 'ปูยุด', 0.00, '', 'img_68d7a5c1b56bb.jpg', 13090.00, 0.00, 1, '2025-09-27 15:52:17'),
(120, 'ID1HR5K57L', 5080.00, 'โตะชุด', '0000000000', '2025-09-01 15:53:00', '', 'บอสจู', '0000000000', 'ลูโบะยือไร', 0.00, '', 'img_68d7a630c84f4.jpg', 5080.00, 0.00, 1, '2025-09-27 15:54:08'),
(121, 'UUHDH9FG9W', 30590.00, 'บอสยัง', '0000000000', '2025-09-03 15:57:00', '', 'ฮากิง', '0000000000', 'ปูยุด', 0.00, '', 'img_68d7a71d1e94f.jpg', 30590.00, 0.00, 1, '2025-09-27 15:58:05'),
(122, '3B8OYYOCB4', 26745.00, 'บอสจู', '0000000000', '2025-09-10 03:54:00', '', '-', '0000000000', 'ปูยุด', 0.00, '', 'img_68d84fa79246f.jpg', 26745.00, 0.00, 1, '2025-09-28 03:57:11'),
(123, 'KUIY0I2A8Z', 13420.00, 'แบเลาะห เเนปาเเด', '0000000000', '2025-09-15 03:58:00', '', 'มะยา-ฟะหมี', '0000000000', 'เเนปาเเด', 0.00, '', 'img_68d85002bac37.jpg', 13420.00, 0.00, 1, '2025-09-28 03:58:42'),
(124, 'IZYQ9PFJ1A', 14648.00, 'บอสยัง', '0000000000', '2025-09-16 04:01:00', '', 'ฮากิง', '0000000000', 'ปูยุด', 0.00, '', 'img_68d850a23b0b5.jpg', 14648.00, 0.00, 1, '2025-09-28 04:01:22'),
(125, 'MUFA43Z91Y', 16343.00, 'บอสจู', '0000000000', '2025-09-16 04:04:00', '', 'ฮากิง', '0000000000', 'ปูยุด', 0.00, '', 'img_68d851660f6c4.jpg', 16343.00, 0.00, 1, '2025-09-28 04:04:38');

-- --------------------------------------------------------

--
-- Table structure for table `order_box`
--

CREATE TABLE `order_box` (
  `order_id` int(11) NOT NULL,
  `order_name` varchar(300) NOT NULL,
  `slip_order` varchar(200) NOT NULL,
  `totalcost_order` decimal(10,2) NOT NULL,
  `count_order` int(11) NOT NULL,
  `id_adder` int(11) NOT NULL,
  `date_time_order` datetime NOT NULL,
  `create_at` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `order_box`
--

INSERT INTO `order_box` (`order_id`, `order_name`, `slip_order`, `totalcost_order`, `count_order`, `id_adder`, `date_time_order`, `create_at`) VALUES
(33, 'กล่องพัสดุ', 'img_68e77fb48310c.jpg', 207082.80, 4, 1, '2025-08-08 16:05:00', '2025-09-13 16:07:09'),
(34, 'กล่องพัสดุ', 'img_68c5350b990af.webp', 159383.10, 3, 1, '2025-08-09 16:08:00', '2025-09-13 16:10:35'),
(35, 'กล่องพัสดุ', 'img_68e77d7c6effe.jpg', 217738.50, 4, 1, '2025-08-14 16:13:00', '2025-09-13 16:15:41'),
(36, 'บล็อค', 'img_68c536a66b0ae.webp', 20000.00, 1, 1, '2025-08-14 16:16:00', '2025-09-13 16:17:26'),
(37, 'กล่องพัสดุ', 'img_68c5372829e53.webp', 163811.60, 3, 1, '2025-08-13 16:18:00', '2025-09-13 16:19:36'),
(38, 'เทปกาว', 'img_68c78b8cc629e.webp', 21756.00, 1, 1, '2025-08-08 10:42:00', '2025-09-15 10:44:12'),
(41, 'ZSKTIA4PYA', 'img_68ca800dddc96.webp', 4500.00, 1, 1, '2025-08-09 16:31:00', '2025-09-17 16:31:57'),
(42, 'BOCX037CT7', 'img_68e77ca1bbf6f.jpeg', 192073.30, 9, 1, '2025-09-22 04:48:00', '2025-09-22 04:53:36'),
(43, 'GYF26174LQ', '', 50000.00, 1, 1, '2025-09-24 10:56:00', '2025-09-24 10:56:54');

-- --------------------------------------------------------

--
-- Table structure for table `order_was_paid`
--

CREATE TABLE `order_was_paid` (
  `waspaid_id` int(11) NOT NULL,
  `debtpaid_id` int(11) NOT NULL,
  `ordersell_ids` int(11) NOT NULL,
  `ordersell_names` varchar(200) NOT NULL,
  `priceto_pay` decimal(10,2) NOT NULL,
  `amount_paid` decimal(10,2) NOT NULL,
  `status_pay` varchar(50) NOT NULL,
  `create_at` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `order_was_paid`
--

INSERT INTO `order_was_paid` (`waspaid_id`, `debtpaid_id`, `ordersell_ids`, `ordersell_names`, `priceto_pay`, `amount_paid`, `status_pay`, `create_at`) VALUES
(2, 11, 93, 'N6PUZ771W4', 30200.00, 20000.00, 'partial', '2025-10-06 09:20:23'),
(3, 12, 93, 'N6PUZ771W4', 10200.00, 10200.00, 'paid', '2025-10-07 15:49:38'),
(4, 13, 90, 'SPEACQ6NK8', 10330.00, 10000.00, 'partial', '2025-10-07 17:12:08'),
(5, 14, 90, 'SPEACQ6NK8', 330.00, 330.00, 'paid', '2025-10-07 17:13:27'),
(6, 15, 108, '2B7OK2GUOL', 21300.00, 20000.00, 'partial', '2025-10-07 17:48:39'),
(7, 16, 108, '2B7OK2GUOL', 1300.00, 300.00, 'partial', '2025-10-08 14:13:05'),
(8, 17, 108, '2B7OK2GUOL', 1000.00, 1000.00, 'paid', '2025-10-08 14:41:09'),
(9, 17, 109, '8MN7CJC8OE', 27100.00, 27100.00, 'paid', '2025-10-08 14:41:09'),
(10, 17, 110, '6NJTUXMZ3I', 26650.00, 11900.00, 'partial', '2025-10-08 14:41:09');

-- --------------------------------------------------------

--
-- Table structure for table `rate_price`
--

CREATE TABLE `rate_price` (
  `rate_id` int(11) NOT NULL,
  `product_name` varchar(200) NOT NULL,
  `id_adder` int(11) NOT NULL,
  `price_custommer_vip` decimal(10,2) NOT NULL,
  `price_customer_frontstore` decimal(10,2) NOT NULL,
  `price_customer_deliver` decimal(10,2) NOT NULL,
  `price_customer_dealer` decimal(10,2) NOT NULL,
  `create_at` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `rate_price`
--

INSERT INTO `rate_price` (`rate_id`, `product_name`, `id_adder`, `price_custommer_vip`, `price_customer_frontstore`, `price_customer_deliver`, `price_customer_dealer`, `create_at`) VALUES
(9, 'ZZX V99', 1, 14.00, 15.50, 18.00, 16.00, '2025-09-01 21:02:01'),
(10, 'SSR7', 1, 17.00, 15.50, 19.50, 16.05, '2025-09-01 21:03:08'),
(11, 'BOX J7', 1, 14.00, 16.00, 21.05, 15.00, '2025-09-01 23:50:18'),
(12, 'BOX J8', 1, 14.00, 15.50, 20.50, 16.05, '2025-09-01 22:46:01'),
(13, 'BOX J8S', 1, 25.50, 25.00, 30.00, 26.00, '2025-09-01 22:47:51'),
(14, 'BOX S9', 1, 15.00, 15.50, 19.70, 16.00, '2025-09-01 22:48:41'),
(15, 'BOX Z4', 1, 13.00, 14.70, 17.50, 15.00, '2025-09-01 22:49:23'),
(16, 'CSR67', 1, 23.50, 25.00, 26.50, 24.00, '2025-09-01 22:50:18'),
(17, 'DORA7', 1, 13.00, 14.00, 17.20, 15.50, '2025-09-01 22:50:52'),
(18, 'J1', 1, 2.30, 2.20, 2.50, 2.00, '2025-09-13 16:23:15'),
(19, 'J2', 1, 4.00, 3.90, 4.20, 3.70, '2025-09-13 16:24:31'),
(20, 'J3', 1, 4.20, 4.10, 4.60, 3.80, '2025-09-17 17:24:36'),
(21, 'J4', 1, 4.30, 4.20, 4.70, 4.00, '2025-09-13 16:27:07'),
(22, 'J5', 1, 6.60, 6.50, 7.00, 6.00, '2025-09-13 16:28:06'),
(23, 'J6', 1, 7.10, 7.00, 9.50, 6.50, '2025-09-13 16:29:22'),
(24, 'J8', 1, 5.60, 5.50, 5.90, 5.10, '2025-09-13 16:30:19'),
(25, 'J10', 1, 8.20, 8.00, 9.75, 7.50, '2025-09-13 16:31:36'),
(26, '๋J12', 1, 10.10, 10.00, 10.20, 9.50, '2025-09-13 16:32:49'),
(27, 'J15', 1, 11.10, 11.00, 11.20, 10.50, '2025-09-13 16:33:38'),
(28, 'G', 1, 14.60, 14.50, 14.90, 14.00, '2025-09-13 16:35:19'),
(29, 'M ', 1, 17.80, 17.70, 17.90, 17.50, '2025-09-13 16:39:31'),
(30, 'เทปกาว', 1, 1300.00, 1280.00, 1350.00, 1250.00, '2025-09-15 10:45:59'),
(31, 'บับเบิ้ล', 1, 105.00, 100.00, 105.00, 100.00, '2025-09-17 16:32:58'),
(32, 'F', 1, 14.20, 14.00, 14.80, 13.50, '2025-09-22 04:59:15'),
(33, 'ฉ', 1, 11.80, 11.50, 12.00, 11.00, '2025-09-22 04:59:49');

-- --------------------------------------------------------

--
-- Table structure for table `sell_typepay`
--

CREATE TABLE `sell_typepay` (
  `typepay_id` int(11) NOT NULL,
  `ordersell_id` int(11) NOT NULL,
  `list_typepay` varchar(70) NOT NULL,
  `create_at` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `sell_typepay`
--

INSERT INTO `sell_typepay` (`typepay_id`, `ordersell_id`, `list_typepay`, `create_at`) VALUES
(94, 90, 'จ่ายสด', '2025-09-27 06:44:18'),
(95, 90, 'ติดค้าง', '2025-09-27 06:44:18'),
(98, 93, 'ติดค้าง', '2025-09-27 06:54:15'),
(99, 94, 'โอน', '2025-09-27 07:00:37'),
(100, 95, 'โอน', '2025-09-27 07:03:37'),
(101, 96, 'โอน', '2025-09-27 07:05:35'),
(102, 97, 'โอน', '2025-09-27 07:08:51'),
(103, 98, 'โอน', '2025-09-27 07:13:35'),
(104, 99, 'โอน', '2025-09-27 07:14:44'),
(105, 100, 'โอน', '2025-09-27 07:17:17'),
(106, 101, 'โอน', '2025-09-27 07:19:11'),
(107, 102, 'โอน', '2025-09-27 07:22:15'),
(108, 103, 'โอน', '2025-09-27 08:02:00'),
(109, 104, 'โอน', '2025-09-27 08:07:05'),
(110, 105, 'โอน', '2025-09-27 08:09:23'),
(111, 106, 'โอน', '2025-09-27 08:10:30'),
(112, 107, 'โอน', '2025-09-27 08:13:29'),
(113, 108, 'ติดค้าง', '2025-09-27 08:18:10'),
(115, 109, 'ติดค้าง', '2025-09-27 08:20:11'),
(116, 110, 'ติดค้าง', '2025-09-27 08:22:37'),
(117, 111, 'โอน', '2025-09-27 15:24:02'),
(118, 112, 'โอน', '2025-09-27 15:33:15'),
(119, 113, 'โอน', '2025-09-27 15:35:20'),
(120, 114, 'โอน', '2025-09-27 15:36:59'),
(121, 115, 'โอน', '2025-09-27 15:39:03'),
(122, 116, 'โอน', '2025-09-27 15:43:10'),
(123, 117, 'โอน', '2025-09-27 15:45:55'),
(124, 118, 'โอน', '2025-09-27 15:48:38'),
(125, 119, 'โอน', '2025-09-27 15:52:17'),
(126, 120, 'โอน', '2025-09-27 15:54:08'),
(127, 121, 'โอน', '2025-09-27 15:58:05'),
(128, 122, 'โอน', '2025-09-28 03:57:11'),
(129, 123, 'โอน', '2025-09-28 03:58:42'),
(130, 124, 'โอน', '2025-09-28 04:01:22'),
(131, 125, 'โอน', '2025-09-28 04:04:38');

-- --------------------------------------------------------

--
-- Table structure for table `stock_product`
--

CREATE TABLE `stock_product` (
  `product_id` int(11) NOT NULL,
  `product_name` varchar(200) NOT NULL,
  `product_count` int(11) NOT NULL,
  `product_price` decimal(10,2) NOT NULL,
  `expenses` decimal(10,2) NOT NULL,
  `id_adder` int(11) NOT NULL,
  `id_order` int(11) NOT NULL,
  `create_at` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `stock_product`
--

INSERT INTO `stock_product` (`product_id`, `product_name`, `product_count`, `product_price`, `expenses`, `id_adder`, `id_order`, `create_at`) VALUES
(55, '๋J12', 10292, 7.20, 74102.40, 1, 33, '2025-09-13 16:07:09'),
(56, 'J5', 10523, 5.00, 52615.00, 1, 33, '2025-09-13 16:07:09'),
(57, 'J2', 10321, 3.20, 33027.20, 1, 33, '2025-09-13 16:07:09'),
(58, 'J4', 13923, 3.40, 47338.20, 1, 33, '2025-09-13 16:07:09'),
(59, 'J15', 9997, 8.30, 82975.10, 1, 34, '2025-09-13 16:10:35'),
(60, 'J10', 11120, 5.90, 65608.00, 1, 34, '2025-09-13 16:10:35'),
(61, 'J6', 2400, 4.50, 10800.00, 1, 34, '2025-09-13 16:10:35'),
(62, 'J1', 12170, 1.50, 18255.00, 1, 35, '2025-09-13 16:15:41'),
(63, 'J6', 7993, 4.50, 35968.50, 1, 35, '2025-09-13 16:15:41'),
(64, 'G', 1410, 12.00, 16920.00, 1, 35, '2025-09-13 16:15:41'),
(65, 'M', 10110, 14.50, 146595.00, 1, 35, '2025-09-13 16:15:41'),
(66, 'ค่าบล็อค J1', 1, 20000.00, 20000.00, 1, 36, '2025-09-13 16:17:26'),
(67, 'G', 8620, 12.00, 103440.00, 1, 37, '2025-09-13 16:19:36'),
(68, 'J8', 7126, 4.10, 29216.60, 1, 37, '2025-09-13 16:19:36'),
(69, 'J3', 10385, 3.00, 31155.00, 1, 37, '2025-09-13 16:19:36'),
(70, 'เทปกาว', 21, 1036.00, 21756.00, 1, 38, '2025-09-15 10:44:12'),
(73, 'บับเบิ้ล', 50, 90.00, 4500.00, 1, 41, '2025-09-17 16:31:57'),
(74, 'J1', 5507, 1.50, 8260.50, 1, 42, '2025-09-22 04:53:36'),
(75, 'J2', 6254, 3.20, 20012.80, 1, 42, '2025-09-22 04:53:36'),
(76, 'J3', 5140, 3.00, 15420.00, 1, 42, '2025-09-22 04:53:36'),
(77, 'J5', 11708, 5.00, 58540.00, 1, 42, '2025-09-22 04:53:36'),
(78, 'J6', 4313, 4.50, 19408.50, 1, 42, '2025-09-22 04:53:36'),
(79, 'J8', 3989, 4.10, 16354.90, 1, 42, '2025-09-22 04:53:36'),
(80, 'J10', 3053, 5.90, 18012.70, 1, 42, '2025-09-22 04:57:11'),
(81, 'ฉ', 1987, 8.50, 16889.50, 1, 42, '2025-09-22 04:57:11'),
(82, 'F', 1792, 10.70, 19174.40, 1, 42, '2025-09-22 04:57:11'),
(83, 'เทปกาว', 50, 1000.00, 50000.00, 1, 43, '2025-09-24 10:56:54');

-- --------------------------------------------------------

--
-- Table structure for table `type_paydebt`
--

CREATE TABLE `type_paydebt` (
  `typedebt_id` int(11) NOT NULL,
  `debtpay_id` int(11) NOT NULL,
  `type_pay` varchar(50) NOT NULL,
  `create_at` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `type_paydebt`
--

INSERT INTO `type_paydebt` (`typedebt_id`, `debtpay_id`, `type_pay`, `create_at`) VALUES
(4, 6, 'โอน', '2025-09-24 12:13:25'),
(5, 7, 'โอน', '2025-09-24 12:14:15'),
(6, 8, 'จ่ายสด', '2025-09-24 12:15:42'),
(7, 9, 'โอน', '2025-09-25 00:18:06'),
(8, 10, 'โอน', '2025-09-25 00:19:44'),
(9, 11, 'จ่ายสด', '2025-10-06 09:20:23'),
(10, 12, 'จ่ายสด', '2025-10-07 15:49:38'),
(11, 13, 'จ่ายสด', '2025-10-07 17:12:08'),
(12, 14, 'โอน', '2025-10-07 17:13:27'),
(13, 14, 'จ่ายสด', '2025-10-07 17:13:27'),
(14, 15, 'โอน', '2025-10-07 17:48:39'),
(15, 15, 'จ่ายสด', '2025-10-07 17:48:39'),
(16, 16, 'จ่ายสด', '2025-10-08 14:13:05'),
(17, 17, 'จ่ายสด', '2025-10-08 14:41:09');

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE `users` (
  `id` int(20) NOT NULL,
  `fullname` varchar(300) NOT NULL,
  `username` varchar(300) NOT NULL,
  `password` varchar(300) NOT NULL,
  `create_at` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`id`, `fullname`, `username`, `password`, `create_at`) VALUES
(1, 'admin', 'admin.com', 'P@ssw0rd', '2025-08-16 11:32:10');

-- --------------------------------------------------------

--
-- Table structure for table `withdraw`
--

CREATE TABLE `withdraw` (
  `withdraw_id` int(11) NOT NULL,
  `withdraw_balance` decimal(10,2) NOT NULL,
  `count_withdraw` decimal(10,2) NOT NULL,
  `slip_withdraw` varchar(300) NOT NULL,
  `date_withdrow` datetime NOT NULL,
  `reason` text NOT NULL,
  `id_adder` int(11) NOT NULL,
  `create_at` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `withdraw`
--

INSERT INTO `withdraw` (`withdraw_id`, `withdraw_balance`, `count_withdraw`, `slip_withdraw`, `date_withdrow`, `reason`, `id_adder`, `create_at`) VALUES
(27, 161051.69, 10000.00, '', '2025-10-08 20:45:00', '', 1, '2025-10-08 20:46:00'),
(28, 151051.69, 10000.00, '', '2025-10-08 20:46:00', 'test 2', 1, '2025-10-08 20:46:58');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `capital`
--
ALTER TABLE `capital`
  ADD PRIMARY KEY (`capital_id`);

--
-- Indexes for table `custom_debtpaid`
--
ALTER TABLE `custom_debtpaid`
  ADD PRIMARY KEY (`id_debtpaid`);

--
-- Indexes for table `list_productsell`
--
ALTER TABLE `list_productsell`
  ADD PRIMARY KEY (`list_sellid`);

--
-- Indexes for table `orders_sell`
--
ALTER TABLE `orders_sell`
  ADD PRIMARY KEY (`id_ordersell`);

--
-- Indexes for table `order_box`
--
ALTER TABLE `order_box`
  ADD PRIMARY KEY (`order_id`);

--
-- Indexes for table `order_was_paid`
--
ALTER TABLE `order_was_paid`
  ADD PRIMARY KEY (`waspaid_id`);

--
-- Indexes for table `rate_price`
--
ALTER TABLE `rate_price`
  ADD PRIMARY KEY (`rate_id`);

--
-- Indexes for table `sell_typepay`
--
ALTER TABLE `sell_typepay`
  ADD PRIMARY KEY (`typepay_id`);

--
-- Indexes for table `stock_product`
--
ALTER TABLE `stock_product`
  ADD PRIMARY KEY (`product_id`);

--
-- Indexes for table `type_paydebt`
--
ALTER TABLE `type_paydebt`
  ADD PRIMARY KEY (`typedebt_id`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `withdraw`
--
ALTER TABLE `withdraw`
  ADD PRIMARY KEY (`withdraw_id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `capital`
--
ALTER TABLE `capital`
  MODIFY `capital_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=26;

--
-- AUTO_INCREMENT for table `custom_debtpaid`
--
ALTER TABLE `custom_debtpaid`
  MODIFY `id_debtpaid` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=18;

--
-- AUTO_INCREMENT for table `list_productsell`
--
ALTER TABLE `list_productsell`
  MODIFY `list_sellid` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=673;

--
-- AUTO_INCREMENT for table `orders_sell`
--
ALTER TABLE `orders_sell`
  MODIFY `id_ordersell` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=127;

--
-- AUTO_INCREMENT for table `order_box`
--
ALTER TABLE `order_box`
  MODIFY `order_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=44;

--
-- AUTO_INCREMENT for table `order_was_paid`
--
ALTER TABLE `order_was_paid`
  MODIFY `waspaid_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=11;

--
-- AUTO_INCREMENT for table `rate_price`
--
ALTER TABLE `rate_price`
  MODIFY `rate_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=34;

--
-- AUTO_INCREMENT for table `sell_typepay`
--
ALTER TABLE `sell_typepay`
  MODIFY `typepay_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=133;

--
-- AUTO_INCREMENT for table `stock_product`
--
ALTER TABLE `stock_product`
  MODIFY `product_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=84;

--
-- AUTO_INCREMENT for table `type_paydebt`
--
ALTER TABLE `type_paydebt`
  MODIFY `typedebt_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=18;

--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
  MODIFY `id` int(20) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `withdraw`
--
ALTER TABLE `withdraw`
  MODIFY `withdraw_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=29;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
